Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs.DialogId
A unique string identifier for DialogBox and TaskDialog type dialogs in Revit.
Remarks:
DialogBox: The unique string ID that can be used to uniquely identify those types of dialogs.
TaskDialog: The customed string if TaskDialog.Id is set, empty string for default TaskDialog.Show()
Standard Message Boxes: Empty string ID.
Since:
2017

Autodesk.Revit.UI.Events.DialogBoxShowingEventArgs.HelpId
An ID that represents the dialog that has been displayed.
Remarks:
Use this ID within your application to key suitable responses for the dialog. Note: this id is
not guaranteed to remain stable for different builds of Autodesk Revit.
Since:
2010